# BoundarySegment Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BoundarySegment Members
BoundarySegment Class Methods Properties See Also
---
The BoundarySegment type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the BoundarySegment |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCurve | Get a copy of the curve that is formed along this boundary. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementId | Retrieve the id of the element that produces this boundary segment. If the segment is created from an element in a link, this is the id of the RevitLinkInstance. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LinkElementId | Retrieve the element id of the element in a link instance that forms this boundary. |

# See Also
BoundarySegment Class
Autodesk.Revit.DB Namespace